{
	"id": "drupal-deprecation",
	"title": "Drupal Deprecation and Site IA Refresh",
	"images": [
		{
			"size": "full",
			"mobile": {
				"webp": {
					"1x": "drupal-deprecation-1-sm.webp",
					"2x": "drupal-deprecation-1-sm-2x.webp"
				},
				"jpg": {
					"1x": "drupal-deprecation-1-sm.jpg",
					"2x": "drupal-deprecation-1-sm-2x.jpg"
				}
			},
			"desktop": {
				"webp": {
					"1x": "drupal-deprecation-1.webp",
					"2x": "drupal-deprecation-1-2x.webp"
				},
				"jpg": {
					"1x": "drupal-deprecation-1.jpg",
					"2x": "drupal-deprecation-1-2x.jpg"
				}
			},
			"width": "1280",
			"height": "512",
			"alt": "Tableau Public Homepage"
		},
		{
			"size": "full",
			"mobile": {
				"webp": {
					"1x": "drupal-deprecation-2-sm.webp",
					"2x": "drupal-deprecation-2-sm-2x.webp"
				},
				"jpg": {
					"1x": "drupal-deprecation-2-sm.jpg",
					"2x": "drupal-deprecation-2-sm-2x.jpg"
				}
			},
			"desktop": {
				"webp": {
					"1x": "drupal-deprecation-2.webp",
					"2x": "drupal-deprecation-2-2x.webp"
				},
				"jpg": {
					"1x": "drupal-deprecation-2.jpg",
					"2x": "drupal-deprecation-2-2x.jpg"
				}
			},
			"width": "1280",
			"height": "587",
			"alt": "Tableau Public Community Resources"
		}
	],
	"role": "Engineer",
	"client": "Tableau",
	"date": "Summer 2022",
	"body": [
		"<p>As a fan of the series since high school, building the official website for the long-awaited Diablo IV was a dream project. I was not just an engineering contributor but the architect as well, creating the system design for the site. Starting a new, greenfield project takes a lot of consideration, so I conducted initial research, diagrammed how all the various technical pieces (services, libraries, etc.) would fit together, defined some of our working processes, and circulated all of that internally for iteration and feedback before production began.</p>",
		"<p>Our designers wanted the experience to be as immersive as possible, so the site expands to cover the entire viewport with each section, makes heavy use of video, and even has an audio player with ambient audio that plays while you browse the site. While the image and video assets are pretty heavy, going with a screen-by-screen structure rather than a long scroll made it easy to only load what was needed. I kept a close eye on overall file size and optimized images during our build process, and we were happy with the resulting Lighthouse scores. The site’s design <a class=\"Link\" href=\"https://www.awwwards.com/BOPBlizzard/\">earned Blizzard an Awwwards Honorable Mention</a>.</p>",
		"<p>The site’s frontend is built entirely with React and the <a class=\"Link\" href=\"https://nextjs.org\">Next.js</a> framework, which we chose to easily enable server-side rendering. Our styles are primarily composed in the Atomic CSS style with <a class=\"Link\" href=\"https://tailwindcss.com\">Tailwind CSS</a>, which I think is impeccably designed, and its creator noticed and had <a class=\"Link\" href=\"https://twitter.com/adamwathan/status/1190421615068270592\">some very kind words</a> for us.</p>",
		"<p><i><strong>Content warning:</strong> Diablo IV is unapologetically dark in tone, and the YouTube videos on the site are extremely violent. You might want to avoid those.</i></p>"
	],
	"buttons": [
		{
			"linkUrl": "https://public.tableau.com/",
			"label": "View Site",
			"labelWithContext": "View Tableau Public"
		}
	]
}
